{

  "schedule": [
    {
      "date": "2016-May-05",
      "groups": [
        {
          "time": "8:00 am",
          "sessions": [
            {
              "name": "Registration and Networking  Breakfast",
              "timeStart": "8:00 am",
              "timeEnd": "9:00 am",
              "tracks": ["Food"]
            }
          ]
        },
        {
          "time": "9:00 am",
          "sessions": [
            {
              "name": "Nurturing  Entrepreneurship  through Open  Source  Culture",
              "location": "Room 2203",
              "speakerNames": ["Ray Hightower"],
              "timeStart": "9:00 am",
              "timeEnd": "9:45 am",
              "tracks": ["Entrepreneurship"]
            },
            {
              "name": "CI & CD Demystified",
              "location": "Room 2202",
              "description": "CI & CD Demystified ",
              "speakerNames": ["Kelvin Mutuma"],
              "timeStart": "9:45 am",
              "timeEnd": "10:45 am",
              "tracks": ["Development"]
            }
          ]
        },
        {
          "time": "10:45 am",
          "sessions": [
            {
              "name": "Break",
              "timeStart": "10:45 am",
              "timeEnd": "11:00 am",
              "tracks": ["Food"]
            },
            {
              "name": "Catch  Me  If  You Can",
              "location": "Room 2201",
              "description": " Catch Me  If  You Can:  Improving the Perception  of  Contrast  by  Introducing the Convergence of  Retinal Neurons",
              "speakerNames": ["Dr. Kendi Muchugi"],
              "timeStart": "11:00 am",
              "timeEnd": "11:45 am",
              "tracks": ["Development"]
            },
            {
              "name": "Automating Releases  for Ruby  on  Rails",
              "location": "Room 2201",
              "description": "Automating  Releases  for Ruby  on  Rails Application on  Productions Servers ",
              "speakerNames": ["Kenneth Kinyanjui"],
              "timeStart": "11:45 am",
              "timeEnd": "1:00 pm",
              "tracks": ["Development"]
            }
          ]
        },
        {
          "time": "1:00 pm",
          "sessions": [
            {
              "name": "Lunch",
              "location": "Auditorium",
              "description": "Come grab lunch with all the Ruby fanatics and talk all things Ruby and Entrepreneurship",
              "timeStart": "1:00 pm",
              "timeEnd": "2:00 pm",
              "tracks": ["Food"]
            }
          ]
        },
        {
          "time": "2:00 pm",
          "sessions": [
            {
              "name": "Prototype",
              "location": "Room 2201",
              "description": "Prototyping for The Enterprise",
              "speakerNames": ["Michael Kimathi"],
              "timeStart": "2:45 pm",
              "timeEnd": "3:30 pm",
              "tracks": ["Entrepreneurship"]
            },
            {
              "name": "Case Study:  Taka  Smart Project Case  Study ",
              "location": "Room 2203",
              "description": "Case  Study:  Taka  Smart Project Case  Study ",
              "speakerNames": ["Clement Habinshuti"],
              "timeStart": "3:30 pm",
              "timeEnd": "4:15 pm",
              "tracks": ["Entrepreneurship"]
            }
          ]
        },

        {
          "time": "4.15 pm",
          "sessions": [
            {
              "name": "Break",
              "location": "Auditorium",
              "description": "Short Interactions between Attendes before Session closes",
              "timeStart": "4:15 pm",
              "timeEnd": "4:30 pm",
              "tracks": ["Food"]
            }
          ]
        },
        {
          "time": "4:30",
          "sessions": [
            {
              "name": "Closing Remark",
              "location": "Room 2201",
              "description": "Closing Remarks by the hosts",
              "speakerNames": ["Michael Kimathi"],
              "timeStart": "4:30 pm",
              "tracks": ["Closing"]
            }
          ]
        }
      ]
    }
  ],
  

  "speakers": [
    {
      "name": "Ray Hightower",
      "profilePic": "http://rubyconf.nairuby.org/images/2016/speakers/raymond.jpg",
      "twitter": "RayHightower",
      "about": "Ray Hightower is a software developer, open source hardware enthusiast, founder of WisdomGroup, and organizer of ChicagoRuby, WindyCityRails, & WindyCityThings. He has visited every state in the USA and most continents on planet Earth. He studied Computer Science and Engineering at the University of Illinois at Urbana-Champaign, and completed his Bachelors in Computer Science at the University of Illinois at Chicago.",
      "location": "Unites States"
    },
    {
      "name": "Michael Kimathi",
      "profilePic": "http://rubyconf.nairuby.org/images/2016/speakers/michael.jpg",
      "twitter": "mikekimmathi",
      "about": "Michael Kimathi has over 7 years experience working in innovative ecosystems and building solutions notably with BlackBerry Developer Community, Nairuby, Masomomoja, GDG, Unbound, University of Nairobi, StartupBlink, BantaMik and Atlassian. Currently, he is an entrepreneur learning from his past failures and developing better solutions which will impact the world we are living in. Previously, he was the Community Development Manager at C4DLab, where he worked closely with team C4DLab to develop innovation strategy, Partnership and change the University culture from the old status quo way of doing things to one at the forefront of innovation, he mentored startups, hosted events, organized entrepreneurship mechanics related talks with distinguished industry entrepreneurs.",
      "location": "Nairobi, Kenya"
    },
    {
      "name": "Manoj Changarampatt",
      "profilePic": "http://rubyconf.nairuby.org/images/2016/speakers/manoj.jpg",
      "about": "Manoj is a business visionary and an independent consultant specializing in building up brands, ecosystems and executing turn-arounds. He lives in Nairobi and he has experience across East & West Africa as well as the Middle East. Having previously worked with Samsung and Nokia, he has a bias towards telecom and technology ventures but can lend support to companies that require retail and distribution expertise as well. After 25 years of corporate experience, he has delved into entrepreneurship with ventures like SavannaByte.com whilst advising entrepreneurs and startups across Nairobi.",
      "location": "Nairobi, Kenya"
    },
    {
      "name": "Dr. Kendi Muchugi",
      "profilePic": "http://rubyconf.nairuby.org/images/2016/speakers/kendi.jpg",
      "twitter": "africanazarene",
      "about": "Dr. Kendi is Computer Science graduate from ANU and a holder of masters degree in Information Systems from the University of Surrey. Her doctoral research is in the field of computational neuroscience and primarily involves computational representation of visual processing within the retina, whilst simulating involvement of retina lateral neurons and allowing the convergence of Rod and Cone systems for the purpose of informing the design and development of retinal prosthesis.",
      "location": "Nairobi, Kenya"
    },
    {
      "name": "Bernard Banta",
      "profilePic": "http://rubyconf.nairuby.org/images/2016/speakers/banta.jpg",
      "twitter": "bantaB",
      "about": "A Computer Scientist and true entrepreneur, he is the founder of Banta Technologies (BT). He has always been passionate about technology and how it can be used to leverage and transform Africa in the way we live, work, play and govern. When it comes to building, his ultimate goal is to make the world a better place. Banta is an entrepreneur and an engineer on the bleeding edge of technology.",
      "location": "Nairobi, Kenya"
    },
    {
      "name": "Alvin Kato",
      "profilePic": "http://rubyconf.nairuby.org/images/2015/speakers/alvin_kato.jpg",
      "twitter": "alvinkatojr",
      "about": "Introduced to programming by a close friend, Alvin abandoned an academic career as an Economist/Statistician for a keyboard and a black screen where he fell in love with ruby and the wonders of rails. His current mission is to transfer this same joy and enthusiasm for coding into the hearts of others.",
      "location": "Nairobi, Kenya"
    },
    {
      "name": "Kelvin Mutuma",
      "profilePic": "http://rubyconf.nairuby.org/images/2016/speakers/mutuma.jpeg",
      "twitter": "KelvinMutuma",
      "about": "FIFA Addict, novel enthusiast, adept coder, reactive and natural, ruby && general FOSS enthusiast. Abacus | GitLab",
      "location": "Nairobi, Kenya"
    },
    {
      "name": "Eugene Mutai",
      "profilePic": "http://rubyconf.nairuby.org/images/2015/speakers/eugene.jpg",
      "twitter": "JheneKnights",
      "about": "Eugene perceives the day he became curious with how Facebook works a calling to greatness. Since then he has self-developed skills by challenging himself with global standards set by guys like Paul Irish and the rest. Eugene has worked in tonnes of project from data analysis, hybrid html5 apps ranging from Android to Blackberry, and finally his favorite web apps. He has expansive knowledge in what it takes to build/powerful web application from architecture, technologies and tools. He is the Nairobi JavaScript Community(user-group) Lead and a consultant at iHub. Also an enthusiast in what they offer the community, thus happy in contributing all what he can.",
      "location": "Nairobi, Kenya"
    },
    {
      "name": "Kenneth Kinyanjui",
      "profilePic": "http://kennethkinyanjui.info/images/kenneth.png",
      "twitter": "kenju254",
      "about": "Kenneth is a Software Engineer, Mentor and Entrepreneur. He is CTO and Co-founder of Infinity Space Inc., an African Company based in Kenya, France and Cameroon. He has also been a consultant for iHub Consulting in Nairobi. As a GDG country mentor, Kenneth has been helping build the Kenyan GDG Community across the country. An active developer and community manager, Kenneth loves contributing to open source projects, facilitating code labs on Google Cloud Platform and mentoring junior developers   .",
      "location": "Nairobi, Kenya"
    },
    {
      "name": "Wycliffe Sawo",
      "profilePic": "http://rubyconf.nairuby.org/images/2015/speakers/sawo.jpg",
      "twitter": "SawoFilush",
      "about": "Sawo is a great lover of code and the amazing things that can be done with it. He has a bias for developing web apps using ruby on rails and currently he is the lead code slinger for BlueGate Technologies. He likes spending his weekends teaching mobile development to GDG M.M.U. His favourite quote, It's not the product, its what you can do with it. ",
      "location": "Madison, WI"
    }
  ],


  "map": [
    {
      "name": "Monona Terrace Convention Center",
      "lat": -1.3939,
      "lng": 36.7442,
      "center": true
    },
    {
      "name": "Ionic HQ",
      "lat": -1.3939,
      "lng": 36.7442
    },
    {
      "name": "Afterparty - Brocach Irish Pub",
      "lat": -1.3939,
      "lng": 36.7442
    }
  ]

}
